[about]
0 = About SmartCoin
1 = Yes
1119 = <a>Official website</a>
1128 = SmartCoin UIDemo V0.01
1129 = Copyright (C) 2014
1130 = SmartCoin QQ Group：33436839

[wallet]
0=Wallet
1101 = Address:
1100 = Account info：
1102 = Latest transaction ：
1124 = Height：
1125 = Information：
1107 = Refresh
1108 = Refresh
1119 = <a>Get SmartCoin for beta</a>

[business]
1001 = Buy
1002 = Arbitration Apply
1003 = Seller confirm
1004 = Arbitrate
1005 = Buyer packing
1006 = Seller sign
1011 = Buyer confirm
1055 = Secured Transaction (3rd-party arbitration)
1056 = Collateral Transaction(No arbitration)
1063 = P2P betting
1008 = Bet
1009 = Receive
1010 = Open
1140 = BetPool
1126 = <a>Secured Transaction Procedure</a>
1120 = <a>Collateral Transaction Procedure</a>
1127 = <a>P2P Betting Procedure</a>

[rpc]
0 = RPC command
1004 = Input：

[base]
1059 = Amount：
1131 = Send Address：
1132 = Receive Address：
1133 = Mining
1001 = Start
1002 = Stop
1114 = Account：
1019 = Fee：
1041 = Transfer
1043 = Account Register
1003 = Send
1085 = Result

[baseex]
1114 = Address：
1019 = Fee：
1094 = Validity period：
1095 = Max amount/Once：
1096 = Max total amount：
1097 = Max amount/Day：
1098 = User-defined data：
1003 = Send
1085 = Result
1001 = Get APP ID
1108 = Address：
1109 = Fee：
1111 = APP path：
1073 = APP Register
1115 = APP ID：
1022 = APP Hash：
1042 = Authorize

[sesure]
0 = Secured Transaction 
1003 = Send
1014 = Buyer ID:
1015 = Seller ID：
1016 = Arbitrator ID:
1017 = Amount：
1018 = Deposit：
1019 = Commission：
1020 = Max compensation：
1021 = Timeout Height
1022 = Last Hash：
1023 = Compensation：
1085 = Result：
1048 = APP ID：
1135 = Address：
1134 = Fee:
1136 = Transaction data
1137 = Contract data
1052 = Level：

[darkcoin]
0 = Collateral Transaction
1014 = Buyer ID：
1015 = Seller ID：
1019 = Fee：
1021 = Timeout Height：
1085 = Result：
1003 = Send
1059 = Amount：
1058 = Last hash：
1004 = Send
1048 = APP ID：
1016 = Buyer Address：
1017 = Seller Address：
1060 = Contract content:

[p2pbet]
0 = P2P betting
1003 = Send
1085 = Result：
1065 = Bet
1067 = Receive
1069 = Open
1066 = Amount：
1070 = Height：
1071 = Random NO.：
1075 = Amount：
1076 = Betting Hash：
1077 = Random NO.：
1081 = Betting Hash：
1082 = Random NO.：
1048 = APP ID：
1001 = Refresh Random NO.
1002 = Get Random NO.
1091 = Address：
1096 = Address：
1049 = APP ID：
1050 = APP ID：

[tip]
0 = Choose the APP
1 = Enter the APP ID or click to get registered APP
2 = Illegal APP ID
3 = Illegal buyer ID
4 = Illegal seller ID
5 = Illegal arbitrator ID
6 = Bet amount must be higher than 0.01
7 = Enter betting random NO.
8 = Must be higher than 10
9 = SmartCoin UIDemo(V0.02Beta) QQ group：334368391





